package com.hammer.app.subwaysimulator



var sandwiches = arrayOf(
        "BLT",
        "えびアボカド",
        "生ハム＆マスカルポーネ",
        "ローストチキン",
        "ローストビーフ　～プレミアム製法～",
        "ターキーベーコンエッグ",
        "チーズローストチキン",
        "てり焼きチキン",
        "チリチキン",
        "ターキーブレスト",
        "ツナ",
        "たまご",
        "アボカドベジー",
        "ベジー＆チーズ",
        "ベジーデライト",
        "アボカドチキン　チポトレ(期間限定)",
        "アボカドベーコン　チポトレ(期間限定)")

var sandPrices = mapOf(
        "BLT" to 420,
        "えびアボカド" to 500,
        "生ハム＆マスカルポーネ" to 520,
        "ローストチキン" to 420,
        "ローストビーフ　～プレミアム製法～" to 590,
        "ターキーベーコンエッグ" to 490,
        "チーズローストチキン" to 480,
        "てり焼きチキン" to 480,
        "チリチキン" to 410,
        "ターキーブレスト" to 450,
        "ツナ" to 430,
        "たまご" to 390,
        "アボカドベジー" to 410,
        "ベジー＆チーズ" to 340,
        "ベジーデライト" to 300,
        "アボカドチキン　チポトレ(期間限定)" to 530,
        "アボカドベーコン　チポトレ(期間限定)" to 530)

var breads = arrayOf(
    "ウィート",
    "ホワイト",
    "セサミ",
    "ハニーオーツ",
    "フラットブレッド"
)

var toppings = arrayOf(
    "ナチュラルスライスチーズ(+ ¥40)",
    "クリームタイプチーズ(+ ¥60)",
    "マスカルポーネチーズ(+ ¥90)",
    "たまご(+ ¥60)",
    "ベーコン(+ ¥60)",
    "ツナ(+ ¥80)",
    "えび(+ ¥100)",
    "アボカド(+ ¥110)"
)

var toppingPrices = mapOf(
        "ナチュラルスライスチーズ(+ ¥40)" to 40,
        "クリームタイプチーズ(+ ¥60)" to 60,
        "マスカルポーネチーズ(+ ¥90)" to 90,
        "たまご(+ ¥60)" to 60,
        "ベーコン(+ ¥60)" to 60,
        "ツナ(+ ¥80)" to 80,
        "えび(+ ¥100)" to 100,
        "アボカド(+ ¥110)" to 110
)

var tmap = mapOf(
        "ナチュラルスライスチーズ(+ ¥40)" to "Cheese",
        "クリームタイプチーズ(+ ¥60)" to "Cream",
        "マスカルポーネチーズ(+ ¥90)" to "Mascar",
        "たまご(+ ¥60)" to "Egg",
        "ベーコン(+ ¥60)" to "Bacon",
        "ツナ(+ ¥80)" to "Tuna",
        "えび(+ ¥100)" to "Shrimp",
        "アボカド(+ ¥110)" to "Avocado"
)

//var vegetables = arrayOf(
//    "レタス",
//    "トマト",
//    "ピーマン",
//    "レッドオニオン",
//    "ニンジン",
//    "オリーブ",
//    "ピクルス",
//    "ホットペッパー"
//)

var dressings = arrayOf(
    "オイル&ビネガー　塩・こしょう",
    "シーザードレッシング",
    "野菜クリーミードレッシング",
    "ハニーマスタードソース",
    "わさび醤油ソース",
    "バジルソース",
    "バルサミコソース",
    "マヨネーズタイプ",
    "チリソース（激辛)"
)

var amounts = arrayOf(
    "無し",
    "少なめ",
    "普通",
    "多め"
)
